Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
eway_method_response" "results-get" {
      - http_method         = "GET" -> null
      - id                  = "agmr-xka9g7txth-7xouh8-GET-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "7xouh8" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.results-options will be destroyed
  # (because aws_api_gateway_method_response.results-options is not in configuration)
  - resource "aws_api_gateway_method_response" "results-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-xka9g7txth-7xouh8-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "7xouh8" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.submit-options will be destroyed
  # (because aws_api_gateway_method_response.submit-options is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-options" {
      - http_method         = "OPTIONS" -> null
      - id                  = "agmr-xka9g7txth-rtq0da-OPTIONS-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "rtq0da" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Headers" = true
          - "method.response.header.Access-Control-Allow-Methods" = true
          - "method.response.header.Access-Control-Allow-Origin"  = true
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.submit-patch will be destroyed
  # (because aws_api_gateway_method_response.submit-patch is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-patch" {
      - http_method         = "PATCH" -> null
      - id                  = "agmr-xka9g7txth-rtq0da-PATCH-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "rtq0da" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_method_response.submit-post will be destroyed
  # (because aws_api_gateway_method_response.submit-post is not in configuration)
  - resource "aws_api_gateway_method_response" "submit-post" {
      - http_method         = "POST" -> null
      - id                  = "agmr-xka9g7txth-rtq0da-POST-200" -> null
      - region              = "ap-southeast-3" -> null
      - resource_id         = "rtq0da" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {
          - "method.response.header.Access-Control-Allow-Origin" = true
        } -> null
      - rest_api_id         = "xka9g7txth" -> null
      - status_code         = "200" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_resource.pipeline_pharmcat will be destroyed
  # (because aws_api_gateway_resource.pipeline_pharmcat is not in configuration)
  - resource "aws_api_gateway_resource" "pipeline_pharmcat" {
      - id          = "akjb77" -> null
      - parent_id   = "p55u3edw3f" -> null
      - path        = "/pipeline_pharmcat" -> null
      - path_part   = "pipeline_pharmcat" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "xka9g7txth" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_resource.results will be destroyed
  # (because aws_api_gateway_resource.results is not in configuration)
  - resource "aws_api_gateway_resource" "results" {
      - id          = "7xouh8" -> null
      - parent_id   = "akjb77" -> null
      - path        = "/pipeline_pharmcat/results" -> null
      - path_part   = "results" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "xka9g7txth" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_api_gateway_resource.submit will be destroyed
  # (because aws_api_gateway_resource.submit is not in configuration)
  - resource "aws_api_gateway_resource" "submit" {
      - id          = "rtq0da" -> null
      - parent_id   = "akjb77" -> null
      - path        = "/pipeline_pharmcat/submit" -> null
      - path_part   = "submit" -> null
      - region      = "ap-southeast-3" -> null
      - rest_api_id = "xka9g7txth" -> null
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.APIGetResultsURL will be destroyed
  # (because aws_lambda_permission.APIGetResultsURL is not in configuration)
  - resource "aws_lambda_permission" "APIGetResultsURL" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-pharmcat-getResultsURL" -> null
      - id                  = "AllowAPIGetResultsURLInvoke" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:execute-api:ap-southeast-3:727260606489:xka9g7txth/*/*/results" -> null
      - statement_id        = "AllowAPIGetResultsURLInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.APIInitPharmcat will be destroyed
  # (because aws_lambda_permission.APIInitPharmcat is not in configuration)
  - resource "aws_lambda_permission" "APIInitPharmcat" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "pgxflow-backend-initPharmcat" -> null
      - id                  = "AllowAPIInitPharmcatInvoke" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:execute-api:ap-southeast-3:727260606489:xka9g7txth/*/*/submit" -> null
      - statement_id        = "AllowAPIInitPharmcatInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPreprocessor will be destroyed
  # (because aws_lambda_permission.LambdaPreprocessor is not in configuration)
  - resource "aws_lambda_permission" "LambdaPreprocessor" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-preprocessor" -> null
      - id                  = "PGxFlowBackendAllowLambdaPreprocessorInvoke" -> null
      - principal           = "lambda.amazonaws.com" -> null
      - region              = "ap-southeast-3" -> null
      - source_arn          = "arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-initPharmcat" -> null
      - statement_id        = "PGxFlowBackendAllowLambdaPreprocessorInvoke" -> null
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.cloudwatch_pharmcat_reference_update_permission will be created
  + resource "aws_lambda_permission" "cloudwatch_pharmcat_reference_update_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-pharmcat-updateReferenceFiles"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = "arn:aws:events:ap-southeast-3:727260606489:rule/pharmcat_update_references_trigger"
      + statement_id        = "CloudwatchPharmcatReferenceUpdateAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.preprocessor_invoke_permission will be created
  + resource "aws_lambda_permission" "preprocessor_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "pgxflow-backend-preprocessor"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSPreprocessorAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_sns_topic.preprocessor will be created
  + resource "aws_sns_topic" "preprocessor" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "pgxflow-backend-preprocessor"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.pgxflow[0].module.pipeline_pharmcat.aws_sns_topic_subscription.preprocessor will be created
  + resource "aws_sns_topic_subscription" "preprocessor" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "arn:aws:lambda:ap-southeast-3:727260606489:function:pgxflow-backend-preprocessor"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_python_libraries_layer:3" -> (known after apply)
      ~ code_sha256                 = "cSJxbNUszRN12fvAZ9IA7uJIkdUMdJT0/h3ZlrvXCgo=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-15T02:14:43.963+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_python_libraries_layer:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/d30ca000c3f8ca74e7e728bfd8ee03e16fa0a2c7ee0e6b88a68a1751b86be52c.zip" -> "builds/9f016887c07011489133500a221c4065986dcb3ef70ddf9aa0775cd1bd453d7e.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 172643 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250521064132794700000002/builds/d30ca000c3f8ca74e7e728bfd8ee03e16fa0a2c7ee0e6b88a68a1751b86be52c.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "eb21a68c4c320467b6612eafca0e76ec" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250521064132794700000002/builds/d30ca000c3f8ca74e7e728bfd8ee03e16fa0a2c7ee0e6b88a68a1751b86be52c.zip" -> (known after apply)
      ~ key                           = "builds/d30ca000c3f8ca74e7e728bfd8ee03e16fa0a2c7ee0e6b88a68a1751b86be52c.zip" -> "builds/9f016887c07011489133500a221c4065986dcb3ef70ddf9aa0775cd1bd453d7e.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/d30ca000c3f8ca74e7e728bfd8ee03e16fa0a2c7ee0e6b88a68a1751b86be52c.zip" -> "builds/9f016887c07011489133500a221c4065986dcb3ef70ddf9aa0775cd1bd453d7e.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/layers/python_libraries/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/9f016887c07011489133500a221c4065986dcb3ef70ddf9aa0775cd1bd453d7e.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/9f016887c07011489133500a221c4065986dcb3ef70ddf9aa0775cd1bd453d7e.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4186669156890615719" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/d30ca000c3f8ca74e7e728bfd8ee03e16fa0a2c7ee0e6b88a68a1751b86be52c.zip" -> "builds/9f016887c07011489133500a221c4065986dcb3ef70ddf9aa0775cd1bd453d7e.zip"
          ~ "timestamp" = "1747809979193101800" -> "1754391447828262000"
        }
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_python_modules_layer:12" -> (known after apply)
      ~ code_sha256                 = "H99cXceERcO45vJ4TcsAjeSoJSGpyMo6xxsNjylQ+gE=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-15T02:15:01.425+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_python_modules_layer:12" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:727260606489:layer:pgxflow_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/0e06c396189f578eaf6fd53c05ac1718fa619fda31210e718f9bf4218e10779b.zip" -> "builds/d451cd6edf41bf00e100e03283a0c21ca5cbfd6f96252f555c5e4210ecb545ed.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 21701 -> (known after apply)
      ~ version                     = "12" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250521064132794700000002/builds/0e06c396189f578eaf6fd53c05ac1718fa619fda31210e718f9bf4218e10779b.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "2f4df6e69dcb894d59ef44a290a05ca5" -> (known after apply)
      ~ id                            = "pgxflow-backend-layers-20250521064132794700000002/builds/0e06c396189f578eaf6fd53c05ac1718fa619fda31210e718f9bf4218e10779b.zip" -> (known after apply)
      ~ key                           = "builds/0e06c396189f578eaf6fd53c05ac1718fa619fda31210e718f9bf4218e10779b.zip" -> "builds/d451cd6edf41bf00e100e03283a0c21ca5cbfd6f96252f555c5e4210ecb545ed.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/0e06c396189f578eaf6fd53c05ac1718fa619fda31210e718f9bf4218e10779b.zip" -> "builds/d451cd6edf41bf00e100e03283a0c21ca5cbfd6f96252f555c5e4210ecb545ed.zip"
      - tags                          = {} -> null
      ~ tags_all                      = {} -> (known after apply)
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "pgxflow/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/d451cd6edf41bf00e100e03283a0c21ca5cbfd6f96252f555c5e4210ecb545ed.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/d451cd6edf41bf00e100e03283a0c21ca5cbfd6f96252f555c5e4210ecb545ed.plan.json"
      + id                   = (known after apply)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "236839967039448976" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/0e06c396189f578eaf6fd53c05ac1718fa619fda31210e718f9bf4218e10779b.zip" -> "builds/d451cd6edf41bf00e100e03283a0c21ca5cbfd6f96252f555c5e4210ecb545ed.zip"
          ~ "timestamp" = "1751333903586702200" -> "1754391445719060800"
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.aws_ecr_repository.this[0] will be updated in-place
  ~ resource "aws_ecr_repository" "this" {
        id                   = "sbeacon-submitdataset-lambda-containers"
        name                 = "sbeacon-submitdataset-lambda-containers"
      ~ tags                 = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all             = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "bba443ed7c912d865482d514be417f6cce5464d6"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:30a4bb34e150f225dd3d3049b6822cb7c1c687675ddf9e674c3d67d838118aba" -> (known after apply)
        name                 = "727260606489.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:30a4bb34e150f225dd3d3049b6822cb7c1c687675ddf9e674c3d67d838118aba" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "ba992f933eefd2e8147f6d857940b24837c85a49" -> "bba443ed7c912d865482d514be417f6cce5464d6"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-admin"
        name              = "/aws/lambda/sbeacon-backend-admin"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-admin"
        name                  = "sbeacon-backend-admin"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-admin:sbeacon-backend-admin-0"
        name        = "sbeacon-backend-admin-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "cognito-idp:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:727260606489:userpool/ap-southeast-3_sNjfbidkU"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-users-info",
                        ]
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-juptyer-notebooks",
                        ]
                    },
                  - {
                      - Action   = [
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:DescribeNotebookInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:727260606489:notebook-instance/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:727260606489:function:cognito-sendRegistrationEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/e422c5a5a69819721da7b18e5f1499cf9144a6835283c4f489d361a121433f1e.zip" -> "builds/dca47654497b1054070a44b12094ba9ff294a9b8744b51c9613eb5e9791b4984.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-07-15T02:16:15.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/dca47654497b1054070a44b12094ba9ff294a9b8744b51c9613eb5e9791b4984.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/dca47654497b1054070a44b12094ba9ff294a9b8744b51c9613eb5e9791b4984.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8484247616109234978" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e422c5a5a69819721da7b18e5f1499cf9144a6835283c4f489d361a121433f1e.zip" -> "builds/dca47654497b1054070a44b12094ba9ff294a9b8744b51c9613eb5e9791b4984.zip"
          ~ "timestamp" = "1751931350919853000" -> "1754391427051959000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-dataPortal"
        name              = "/aws/lambda/sbeacon-backend-dataPortal"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-dataPortal"
        name                  = "sbeacon-backend-dataPortal"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0"
        name        = "sbeacon-backend-dataPortal-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-users-info",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-saved-queries",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-pricing-cache",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-juptyer-notebooks",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinical-variants",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinical-annotations",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = "pricing:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users/index/uid-index",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                        ]
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:727260606489:userpool/ap-southeast-3_sNjfbidkU"
                    },
                  - {
                      - Action   = [
                          - "sagemaker:UpdateNotebookInstance",
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:StartNotebookInstance",
                          - "sagemaker:ListNotebookInstances",
                          - "sagemaker:DescribeNotebookInstance",
                          - "sagemaker:DeleteNotebookInstance",
                          - "sagemaker:CreatePresignedNotebookInstanceUrl",
                          - "sagemaker:CreateNotebookInstance",
                          - "sagemaker:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:727260606489:notebook-instance/*"
                    },
                  - {
                      - Action   = "sagemaker:ListNotebookInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::727260606489:role/sbeacon_backend_sagemaker_jupyter_instance_role"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*",
                                  - "private/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal20250521064203402700000004"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003/*",
                          - "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/projects/*",
                        ]
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/private/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250521064132931100000003"
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::pgxflow-backend-20250521064132931100000003/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:727260606489:function:sbeacon-backend-submitDataset",
                          - "arn:aws:lambda:ap-southeast-3:727260606489:function:sbeacon-backend-indexer",
                          - "arn:aws:lambda:ap-southeast-3:727260606489:function:sbeacon-backend-generateReports",
                          - "arn:aws:lambda:ap-southeast-3:727260606489:function:sbeacon-backend-generateCohortVCfs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-1"
        name        = "sbeacon-backend-dataPortal-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-mutex-locks"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a425d65e6951db012ddc5692140e6971355588080f260db84bac8568c76b4c50.zip" -> "builds/dec85f9c522803dcc069595a41f498b08066aa6292dc8790e203a8a1fb1fd9ec.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-07-15T02:17:54.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/dec85f9c522803dcc069595a41f498b08066aa6292dc8790e203a8a1fb1fd9ec.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/dec85f9c522803dcc069595a41f498b08066aa6292dc8790e203a8a1fb1fd9ec.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7119533880335201300" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a425d65e6951db012ddc5692140e6971355588080f260db84bac8568c76b4c50.zip" -> "builds/dec85f9c522803dcc069595a41f498b08066aa6292dc8790e203a8a1fb1fd9ec.zip"
          ~ "timestamp" = "1751931351916291000" -> "1754391427374243000"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-deidentifyFiles"
        name              = "/aws/lambda/sbeacon-backend-deidentifyFiles"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-deidentifyFiles"
        name                  = "sbeacon-backend-deidentifyFiles"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "sbeacon-backend-deidentifyFiles:sbeacon-backend-deidentifyFiles"
        name        = "sbeacon-backend-deidentifyFiles"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250521064203402700000004"
                    },
                  - {
                      - Action   = [
                          - "s3:HeadObject",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/staging/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250521064203402700000004/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-vcfs",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-projects",
                        ]
                    },
                  - {
                      - Action   = [
                          - "ec2:RunInstances",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeImages",
                          - "ec2:CreateTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::727260606489:role/sbeacon_backend_ec2_deidentification_instance_role"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/76e86e3e11a69ecc9f0725dfa1c155d60ad9da3230a6e2e7bf443cd739a38e49.zip" -> "builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip"
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ last_modified                  = "2025-07-15T02:17:09.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_binaries_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/deidentifyFiles",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "7809955352808484213" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/76e86e3e11a69ecc9f0725dfa1c155d60ad9da3230a6e2e7bf443cd739a38e49.zip" -> "builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip"
          ~ "timestamp" = "1751333888878681000" -> "1754391428133494000"
        }
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-generateCohortVCfs"
        name              = "/aws/lambda/sbeacon-backend-generateCohortVCfs"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-generateCohortVCfs"
        name                  = "sbeacon-backend-generateCohortVCfs"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-1"
        name        = "sbeacon-backend-generateCohortVCfs-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:GetQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:athena:ap-southeast-3:727260606489:workgroup/query_workgroup"
                    },
                  - {
                      - Action   = "glue:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003/*",
                          - "arn:aws:s3:::gaspi-metadata20250521064201492000000003",
                        ]
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-dataportal-project-users/index/uid-index"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_iam_role_policy.additional_jsons[2] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-generateCohortVCfs:sbeacon-backend-generateCohortVCfs-2"
        name        = "sbeacon-backend-generateCohortVCfs-2"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Ontologies",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Descendants",
                          - "arn:aws:dynamodb:ap-southeast-3:727260606489:table/sbeacon-Anscestors",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_python_modules_layer:5",
          - "arn:aws:lambda:ap-southeast-3:727260606489:layer:sbeacon_backend_binaries_layer:5",
        ] -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5624607913122667411" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747809668530170000" -> "1754391426584032000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.lambda-generateReports.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-generateReports"
        name              = "/aws/lambda/sbeacon-backend-generateReports"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-generateReports"
        name                  = "sbeacon-backend-generateReports"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-generateReports:sbeacon-backend-generateReports-0"
        name        = "sbeacon-backend-generateReports-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:727260606489:table/svep-references"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/a25961aa8739ce66a24225e5eb4e93f5109290ea8f672e5a1dba7246e9750722.zip" -> "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip"
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-07-15T02:15:17.000+0000" -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DPORTAL_BUCKET"               = "gaspi-dataportal20250521064203402700000004"
                # (1 unchanged element hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/generateReports/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/generateReports",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5031679036035905822" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a25961aa8739ce66a24225e5eb4e93f5109290ea8f672e5a1dba7246e9750722.zip" -> "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip"
          ~ "timestamp" = "1751333889445265000" -> "1754391428129450000"
        }
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/sbeacon-backend-getAnalyses"
        name              = "/aws/lambda/sbeacon-backend-getAnalyses"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "sbeacon-backend-getAnalyses"
        name                  = "sbeacon-backend-getAnalyses"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-0"
        name        = "sbeacon-backend-getAnalyses-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:727260606489:function:sbeacon-backend-splitQuery"
                    },
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:727260606489:splitQuery"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1"
        name        = "sbeacon-backend-getAnalyses-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.